chess = {
    'b': '卒',
    'p': '砲',
    'c': '車',
    'm': '馬',
    'x': '象',
    's': '士',
    'k': '將',
    'B': '兵',
    'P': '炮',
    'C': '俥',
    'M': '傌',
    'X': '相',
    'S': '仕',
    'K': '帥'
}

board_data = [[0]*9]*10
board_line = [['┏', '━┯'*7, '━┓'], 
              ['┠', '─┼'*7, '─┨'],
              ['┠', '─┼'*7, '─┨'],
              ['┠', '─┼'*7, '─┨'],
              ['┠', '═╧'*7, '═┨'],
              ['┠', '═╤'*7, '═┨'],
              ['┠', '─┼'*7, '─┨'],
              ['┠', '─┼'*7, '─┨'],
              ['┠', '─┼'*7, '─┨'],
              ['┗', '━┷'*7, '━┛']]

board_data = [['c', 'm', 'x', 's', 'k', 's', 'x', 'm', 'c'],
              ['0'*9],
              ['0', 'p', '0'*5, 'p', '0'],
              ['b', '0', 'b', '0', 'b', '0', 'b', '0', 'b'],
              []]

for chess in board_data:
    for c in chess:
        print(c, end='')
    print()
# print(board_data)



for line in board_line:
    for l in line:
        
        print(l, end='')
    print()